In [1]:
import panda as pd
import numpy as np

ModuleNotFoundError: No module named 'panda'

In [7]:
import numpy as np

In [9]:
import pandas as pd

In [ ]:
s= pd.Series([45,22,17,3,33,16,8,5 ],dtype=np.int8)

In [ ]:
s[4]

In [ ]:
s

In [ ]:
roll=pd.Series([1,2,3,4,5])

In [ ]:
name=pd.Series(['nitin','sumit','rani','anjali','smita'])

In [ ]:
marks=pd.Series([60,50,5,45,78,86,5])

In [ ]:
df = pd.DataFrame({
    'Roll':roll,
    'Name':name,
    'Marks':marks
})

In [ ]:
df

In [ ]:
df.dtypes

In [ ]:
df.shape

In [ ]:
df.size

In [ ]:
# https://mitu.co.in/dataset
# Download all the files whose name starts with student
# Store in current working directory in folder datasets/

In [ ]:
import os

In [ ]:
os.getcwd()

In [10]:
df=pd.read_csv('Datasets/student.csv')

In [ ]:
df

In [ ]:
type(df)

In [ ]:
df=pd.read_csv('Datasets/student1.csv')

In [ ]:
df

In [ ]:
df=pd.read_csv('Datasets/student1.csv',names=['A','B','C','D','E'])

In [ ]:
df

In [ ]:
df=pd.read_csv('Datasets/student1.csv',names=['A','B','C','D','E','F'])

In [ ]:
df

In [ ]:
None

In [ ]:
df=pd.read_csv('Datasets/student1.csv',names=None)

In [ ]:
df

In [ ]:
df=pd.read_csv('Datasets/student.csv',names=None)

In [ ]:
df

In [ ]:
df=pd.read_csv('Datasets/student1.csv',header=None)

In [ ]:
df

In [ ]:
df3=pd.read_csv('Datasets/student3.tsv')

In [ ]:
df3

In [ ]:
df3=pd.read_csv('Datasets/student3.tsv', sep='\t')

In [ ]:
df3

In [ ]:
df3=pd.read_csv('https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv')

In [ ]:
df3

In [ ]:
df.dtypes

In [ ]:
df.columns

In [ ]:
df.values

In [ ]:
df.index

In [ ]:
df.transpose

In [ ]:
df.T

In [ ]:
df.head()

In [ ]:
df.head(3)

In [ ]:
df.tail()

In [ ]:
df.tail(3)

# Index Based Slicing

In [ ]:
df.iloc[2:8,1:4]

In [ ]:
df.iloc[:8,:4]

In [ ]:
df.iloc[2:,1:]

In [ ]:
df.iloc[:,:]

In [ ]:
df.iloc[4:5,:]

In [ ]:
df.iloc[[3,7,5,9],:]

In [ ]:
df.iloc[[2,4],[2,3]]

In [ ]:
df.iloc[4:5,:]

In [ ]:
df.iloc[:,4:5]

In [ ]:
df.iloc[4:5,4:5]

In [ ]:
df.iloc[4,4]

# Label Based Slicing

In [ ]:
df.loc[:'name']

In [ ]:
df

In [ ]:
df3.loc[:'name']

In [ ]:
df=pd.read_csv('Datasets/student.csv')

In [ ]:
df.loc[:,'name']

In [ ]:
df['name']

In [ ]:
df

In [ ]:
df[['name','marks']]

In [ ]:
df.name

In [ ]:
df.name,marks

In [ ]:
df.name.values

In [ ]:
df.drop(5)

In [ ]:
df.drop([2,5,7])

In [ ]:
df.drop('class',axis=1)

In [ ]:
df.drop(['class','age'],axis=1)

In [ ]:
df.drop(['class','age'],axis=1, inplace=True)

In [ ]:
df.shape

# Function

In [ ]:
df['marks'].max()

In [ ]:
df['marks'].min()

In [ ]:
df['marks'].mean()

In [ ]:
df['marks'].median()

In [ ]:
df['marks'].std()

In [ ]:
df=pd.read_csv('Datasets/student.csv')

In [ ]:
df.count()

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df.max()

In [ ]:
df.sum()

In [ ]:
df.std(numeric_only=True)

In [ ]:
df.sum(axis=1, numeric_only=True)

In [ ]:
df

In [ ]:
df['age'].value_counts()

In [ ]:
df.sort_values('class')

In [ ]:
df.sort_values('class',ascending=False)

In [ ]:
df.sort_values(['class','marks'])

# custom column Operation

In [ ]:
df['marks']+0.5

In [ ]:
df['marks']=df['marks']+0.5

In [ ]:
df

In [ ]:
df['cgpa']=df['marks']/10+0.034

In [ ]:
df

In [ ]:
df['First_class']=df['marks']>60

In [ ]:
df

In [ ]:
x=['M','M','F','M','F','M','M','M','M','F']

In [ ]:
df['gender']=x

In [ ]:
df

In [ ]:
ndf=pd.DataFrame({
     'roll':range(1,11),
    'cgpa':df['marks']/10+0.34,
    'gender':['M','M','F','M','F','M','M','M','M','F']
})

In [ ]:
ndf

In [11]:
df=pd.read_csv('Datasets/student.csv')

In [ ]:
df.columns

In [ ]:
ndf.columns

In [ ]:
df.merge(ndf, on='roll')

In [ ]:
df5=pd.read_csv('Datasets/student5.csv')

In [ ]:
df5

In [ ]:
pd.concat([df,df5])

In [ ]:
pd.concat([df,df5], ignore_index=True)

In [ ]:
name='Tushar'

name.lower()

In [ ]:
name.lower()

In [ ]:
df['name'].str.endswith('t')

In [ ]:
gr=df.groupby('class')

In [ ]:
gr.groups

In [ ]:
gr.get_group('TE')

In [ ]:
gr.min()

In [ ]:
gr['marks'].max()

In [ ]:
df['marks']>60

In [ ]:
mask=df['marks']>60
df[mask]

In [ ]:
df[df['marks']>60]

In [ ]:
df[df['name'].str.startswith('an')]

In [ ]:
x=df[(df['marks']>60)& (df['class']=='BE')]

# Export the Data

In [ ]:
x.to_csv('Datasets/output.csv',index=False)

In [ ]:
x.to_html('Datasets/output.html',index=False)

# 24 Data Validation

In [ ]:
import pandas as pd

In [ ]:
data=pd.read_csv('Datasets/student3.tsv')

In [ ]:
data

In [ ]:
data=pd.read_csv('Datasets/student3.tsv', sep='\t')

In [ ]:
data

In [ ]:
data['age'].mean()

In [ ]:
data['marks'].mean()

In [13]:
data=pd.read_csv('Datasets/student3.csv')

In [ ]:
data

In [ ]:
data['marks '].mean()

In [ ]:
data.columns.str.strip()

In [ ]:
data['marks '].mean()

#str.strip() # for remove extra step

In [14]:
df.columns=data.columns.str.strip()

In [15]:
df['marks'].mean()

64.499

In [16]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [17]:
df['name']=df['name'].str.title()

In [18]:
df

   roll     name class  marks  age
0     1     Anil    TE  56.77   22
1     2     Amit    TE  59.77   21
2     3   Aniket    BE  76.88   19
3     4  Ajinkya    TE  69.66   20
4     5     Asha    TE  63.28   20
5     6   Ayesha    BE  49.55   20
6     7     Amar    BE  65.34   19
7     8    Amita    BE  68.33   23
8     9     Amol    TE  56.75   20
9    10    Anmol    BE  78.66   21

In [19]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [20]:
data.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13    False
14    False
15    False
dtype: bool

In [21]:
data[data.duplicated()]

   roll  name class  marks    age
9     9  amol    TE   56.75  20.0

In [22]:
data.drop(9)

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28   NaN
5      6   ayesha    BE     NaN  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66   NaN
11    11   surbhi    TE     NaN  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin   NaN   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [23]:
data.drop_duplicates()

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28   NaN
5      6   ayesha    BE     NaN  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66   NaN
11    11   surbhi    TE     NaN  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin   NaN   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [25]:
data.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13    False
14    False
15    False
dtype: bool

In [26]:
data.drop_duplicates()

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28   NaN
5      6   ayesha    BE     NaN  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66   NaN
11    11   surbhi    TE     NaN  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin   NaN   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [29]:
data.drop_duplicates(inplace=True) # Drop Duplicated entries

In [30]:
data.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
10    False
11    False
12    False
13    False
14    False
15    False
dtype: bool

In [31]:
data.count() # check missing value in data frame

roll      15
name      15
class     14
marks     13
age       13
dtype: int64

In [32]:
df=data

In [33]:
df.count()

roll      15
name      15
class     14
marks     13
age       13
dtype: int64

In [34]:
df.isnull()

     roll   name  class  marks     age
0   False  False  False   False  False
1   False  False  False   False  False
2   False  False  False   False  False
3   False  False  False   False  False
4   False  False  False   False   True
5   False  False  False    True  False
6   False  False  False   False  False
7   False  False  False   False  False
8   False  False  False   False  False
10  False  False  False   False   True
11  False  False  False    True  False
12  False  False  False   False  False
13  False  False  False   False  False
14  False  False   True   False  False
15  False  False  False   False  False

In [35]:
df[df.isnull()]

    roll name class  marks   age
0    NaN  NaN   NaN     NaN  NaN
1    NaN  NaN   NaN     NaN  NaN
2    NaN  NaN   NaN     NaN  NaN
3    NaN  NaN   NaN     NaN  NaN
4    NaN  NaN   NaN     NaN  NaN
5    NaN  NaN   NaN     NaN  NaN
6    NaN  NaN   NaN     NaN  NaN
7    NaN  NaN   NaN     NaN  NaN
8    NaN  NaN   NaN     NaN  NaN
10   NaN  NaN   NaN     NaN  NaN
11   NaN  NaN   NaN     NaN  NaN
12   NaN  NaN   NaN     NaN  NaN
13   NaN  NaN   NaN     NaN  NaN
14   NaN  NaN   NaN     NaN  NaN
15   NaN  NaN   NaN     NaN  NaN

In [36]:
False+True

1

In [38]:
df.isnull().sum() # all missing values in the Data Frame

roll      0
name      0
class     1
marks     2
age       2
dtype: int64

In [40]:
df.dropna() # Drop all the rows which contain missing values

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
15    15  shalini    TE   63.45  20.0

In [47]:
df['marks '].fillna(50) # fill fix value at missing value in Data Frameat Marks column

0     56.77
1     59.77
2     76.88
3     69.66
4     63.28
5     50.00
6     65.34
7     68.33
8     56.75
10    78.66
11    50.00
12    74.12
13    88.45
14    59.33
15    63.45
Name: marks , dtype: float64

In [48]:
df['age'].fillna(20) #fill fix value at missing value in Data Frame at Age Column

0     22.0
1     21.0
2     19.0
3     20.0
4     20.0
5     20.0
6     19.0
7     23.0
8     20.0
10    20.0
11    23.0
12    22.0
13    21.0
14    21.0
15    20.0
Name: age, dtype: float64

In [51]:
df['marks '].fillna(df['marks '].mean()) #fill mean Value value at missing value in Data Frame at Marks Column

0     56.770000
1     59.770000
2     76.880000
3     69.660000
4     63.280000
5     67.753077
6     65.340000
7     68.330000
8     56.750000
10    78.660000
11    67.753077
12    74.120000
13    88.450000
14    59.330000
15    63.450000
Name: marks , dtype: float64

In [54]:
df['age'].fillna(df['age'].median()) #fill median Value value at missing value in Data Frame at age Column

0     22.0
1     21.0
2     19.0
3     20.0
4     21.0
5     20.0
6     19.0
7     23.0
8     20.0
10    21.0
11    23.0
12    22.0
13    21.0
14    21.0
15    20.0
Name: age, dtype: float64

In [55]:
df['class'].mode()

0    TE
Name: class, dtype: object

In [57]:
df['class'].fillna(df['class'].mode()) #fill mode Value value at missing value in Data Frame at class Column

0      TE
1      TE
2      BE
3      TE
4      TE
5      BE
6      BE
7      be
8      TE
10     BE
11     TE
12     TE
13     be
14    NaN
15     TE
Name: class, dtype: object

In [ ]:
df['class'].fillna(df['class'].mode()) #fill mode Value value at missing value in Data Frame at class Column # Output Series

In [59]:
df['class'].mode()[0] # series at location 1st (Zero)

'TE'

In [60]:
df['class'].fillna(df['class'].mode()[0]) #fill mode Value value at missing value in Data Frame at class Column

0     TE
1     TE
2     BE
3     TE
4     TE
5     BE
6     BE
7     be
8     TE
10    BE
11    TE
12    TE
13    be
14    TE
15    TE
Name: class, dtype: object

In [62]:
df.ffill() # check all data in data are clean forwaard fill

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28  20.0
5      6   ayesha    BE   63.28  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66  20.0
11    11   surbhi    TE   78.66  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin    be   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [63]:
df.bfill()

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28  20.0
5      6   ayesha    BE   65.34  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66  23.0
11    11   surbhi    TE   74.12  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin    TE   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [64]:
df.bfill(inplace=True)

In [65]:
df

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28  20.0
5      6   ayesha    BE   65.34  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66  23.0
11    11   surbhi    TE   74.12  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin    TE   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [66]:
df.isnull().sum()

roll      0
name      0
class     0
marks     0
age       0
dtype: int64